In [5]:
import pandas as pd
df={"day":["1/1/2019","2/2/1010","7/9/8090","2/9/90"],
     "event":["snow","rainy",'hoty','colly'] ,
      "temprature":[12,34,23,13],
       "windspeed":[12,33,2,11]
   }  
dff=pd.DataFrame(df)
dff

        day  event  temprature  windspeed
0  1/1/2019   snow          12         12
1  2/2/1010  rainy          34         33
2  7/9/8090   hoty          23          2
3    2/9/90  colly          13         11

In [6]:
dff.describe()

       temprature  windspeed
count    4.000000   4.000000
mean    20.500000  14.500000
std     10.279429  13.127579
min     12.000000   2.000000
25%     12.750000   8.750000
50%     18.000000  11.500000
75%     25.750000  17.250000
max     34.000000  33.000000

In [7]:
dff

        day  event  temprature  windspeed
0  1/1/2019   snow          12         12
1  2/2/1010  rainy          34         33
2  7/9/8090   hoty          23          2
3    2/9/90  colly          13         11

In [8]:
dff.temprature.max()

34

In [9]:
dff.temprature.min()

12

In [10]:
dff.temprature.mean()

20.5

In [11]:
dff.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
dff.set_index('day',inplace=True)
dff

          event  temprature  windspeed
day
1/1/2019   snow          12         12
2/2/1010  rainy          34         33
7/9/8090   hoty          23          2
2/9/90    colly          13         11

In [14]:
dff.reset_index(inplace=True)
dff

        day  event  temprature  windspeed
0  1/1/2019   snow          12         12
1  2/2/1010  rainy          34         33
2  7/9/8090   hoty          23          2
3    2/9/90  colly          13         11

In [15]:
dff.day

0    1/1/2019
1    2/2/1010
2    7/9/8090
3      2/9/90
Name: day, dtype: object

In [17]:
dff.loc[1]

day           2/2/1010
event            rainy
temprature          34
windspeed           33
Name: 1, dtype: object

In [22]:
exc=pd.read_excel("dataa.xlsx")
exc

  tickets            eps revenue      people price
0   GOOGL             27      87  laary page    64
1     WMT            5.4      65         n.a    33
2    MSKT             -1      64  nbillgates    22
3     RIL  not available    1023      mukesh    11
4    TATA              9     n.a        rtab   n.a